Revit 2024 API
BuiltInFailures.RebarCouplerFailures.MainEngagementParameterError Property
 This is used to post error. "Bar Engagement 1" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MainEngagementParameterError { get; }
Visual Basic
Public Shared ReadOnly Property MainEngagementParameterError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MainEngagementParameterError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace